Hi @schematis 👋  ,

thank you for raising the issue!
I was looking into this issue using the provider version 5.100.0 and below code

```hcl
resource "aws_elasticache_replication_group" "example" {
  preferred_cache_cluster_azs = ["eu-central-1a", "eu-central-1b"]
  replication_group_id        = "tf-rep-group-1"
  description                 = "example description"
  node_type                  = "cache.t2.small"
  num_cache_clusters          = 2
  engine = "valkey"

  lifecycle {
    ignore_changes = [num_cache_clusters]
  }
}
```
A `terraform apply` was not giving an error

```shell
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_replication_group.example will be created
  + resource "aws_elasticache_replication_group" "example" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "example description"
      + engine                         = "valkey"
      + engine_version                 = (known after apply)
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = (known after apply)
      + node_type                      = "cache.t2.small"
      + num_cache_clusters             = 2
      + num_node_groups                = (known after apply)
      + parameter_group_name           = (known after apply)
      + preferred_cache_cluster_azs    = [
          + "eu-central-1a",
          + "eu-central-1b",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "tf-rep-group-1"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = (known after apply)
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = (known after apply)
      + transit_encryption_mode        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_elasticache_replication_group.example: Creating...
aws_elasticache_replication_group.example: Still creating... [00m10s elapsed]
aws_elasticache_replication_group.example: Still creating... [00m20s elapsed]
aws_elasticache_replication_group.example: Still creating... [00m30s elapsed]
aws_elasticache_replication_group.example: Still creating... [00m40s elapsed]
aws_elasticache_replication_group.example: Still creating... [00m50s elapsed]
aws_elasticache_replication_group.example: Still creating... [01m00s elapsed]
aws_elasticache_replication_group.example: Still creating... [01m10s elapsed]
aws_elasticache_replication_group.example: Still creating... [01m20s elapsed]
aws_elasticache_replication_group.example: Still creating... [01m30s elapsed]
aws_elasticache_replication_group.example: Still creating... [01m40s elapsed]
aws_elasticache_replication_group.example: Still creating... [01m50s elapsed]
aws_elasticache_replication_group.example: Still creating... [02m00s elapsed]
aws_elasticache_replication_group.example: Still creating... [02m10s elapsed]
aws_elasticache_replication_group.example: Still creating... [02m20s elapsed]
aws_elasticache_replication_group.example: Still creating... [02m30s elapsed]
aws_elasticache_replication_group.example: Still creating... [02m40s elapsed]
aws_elasticache_replication_group.example: Still creating... [02m50s elapsed]
aws_elasticache_replication_group.example: Still creating... [03m00s elapsed]
aws_elasticache_replication_group.example: Still creating... [03m10s elapsed]
aws_elasticache_replication_group.example: Still creating... [03m20s elapsed]
aws_elasticache_replication_group.example: Still creating... [03m30s elapsed]
aws_elasticache_replication_group.example: Still creating... [03m40s elapsed]
aws_elasticache_replication_group.example: Still creating... [03m50s elapsed]
aws_elasticache_replication_group.example: Still creating... [04m00s elapsed]
aws_elasticache_replication_group.example: Still creating... [04m10s elapsed]
aws_elasticache_replication_group.example: Still creating... [04m20s elapsed]
aws_elasticache_replication_group.example: Still creating... [04m30s elapsed]
aws_elasticache_replication_group.example: Still creating... [04m40s elapsed]
aws_elasticache_replication_group.example: Still creating... [04m50s elapsed]
aws_elasticache_replication_group.example: Still creating... [05m00s elapsed]
aws_elasticache_replication_group.example: Still creating... [05m10s elapsed]
aws_elasticache_replication_group.example: Still creating... [05m20s elapsed]
aws_elasticache_replication_group.example: Still creating... [05m30s elapsed]
aws_elasticache_replication_group.example: Still creating... [05m40s elapsed]
aws_elasticache_replication_group.example: Still creating... [05m50s elapsed]
aws_elasticache_replication_group.example: Still creating... [06m00s elapsed]
aws_elasticache_replication_group.example: Still creating... [06m10s elapsed]
aws_elasticache_replication_group.example: Still creating... [06m20s elapsed]
aws_elasticache_replication_group.example: Creation complete after 6m30s [id=tf-rep-group-1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Do you remember which provider version you used?  This would help me to reproduce the issue.

